

/**========================================================

                  @Note - MongoDB 연결하는 로직

 ===========================================================*/

const mongoose = require('mongoose');

module.exports = () => {

    /*=========================== 디비 연결 메소드 ===========================*/
  const connent = () => {
      mongoose.connect(`mongodb://root:15935713@localhost:27017/admin`, {
          dbName: 'nodejs', // DB name
      }, (err) => {
          if (err) {
              //  console.error(err);
              console.log('몽고 디비 연결 실패', err);
          } else {
              console.log('몽고 디비 연결 성공')
          }
      });
  };
    /*=======================================================================*/

    /** =========================== 이벤트 핸들링 부분 ===========================*/
    mongoose.connection.on('err',(err=>{
        console.log('몽고 디비 연결 실패',err);
    }));


    mongoose.connection.on('disconnented',(err=>{
        console.log('몽고 디비 연결이 끊어졌습니다. 재시도 합니다.');

        connent(); // 재연결 시도
    }));

    /**======================================================================*/

    // ============================ 실행 로직 ===================================/

        // 1 . 연결시도
    connent();


        // 2 . 스키마 로딩
    require('./user');
    require('./comment');

    //===========================================================================/

};